{
  "modelTopology": {
    "keras_version": "2.4.0",
    "model_config": {
      "class_name": "Sequential",
      "config": [
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform"
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "input_shape": [null, 784]
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 10,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1.0,
                "mode": "fan_avg",
                "distribution": "uniform"
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            }
          }
        }
      ]
    },
    "weightsManifest": [
      {
        "paths": [
          "group1-shard1of1.bin"
        ],
        "weights": [
          {
            "name": "dense/kernel",
            "dtype": "float32",
            "shape": [784, 128]
          },
          {
            "name": "dense/bias",
            "dtype": "float32",
            "shape": [128]
          },
          {
            "name": "dense_1/kernel",
            "dtype": "float32",
            "shape": [128, 10]
          },
          {
            "name": "dense_1/bias",
            "dtype": "float32",
            "shape": [10]
          }
        ]
      }
    ]
  }
}